       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.  
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01  WRK-MESES.
           02 WRK-MES PIC X(3) OCCURS 12 TIMES.
           02 WRK-MES-VENDAS PIC 9(06)V99 VALUE ZEROS OCCURS 12 TIMES.
       77  MES-DIGITADO PIC 9(3) VALUE ZERO.
       
       77  WRK-MES-VENDAS-ED PIC $ZZZ.ZZ9,99.
       77  WRK-CONT PIC 9(2) VALUE ZERO.
       77  WRK-VALOR-VENDA-DIGITADO PIC 9(06)V99 VALUE ZEROS.

       PROCEDURE DIVISION.

           PERFORM 0001-DEFINIR-MESES.

           PERFORM 0003-PERGUNTAR-MES-VENDAS-PRINTAR UNTIL MES-DIGITADO
            = 99.
           
           DISPLAY 'PROGRAMA ENCERRADO'.
           
           STOP RUN. 

       0001-DEFINIR-MESES.
           MOVE 'JAN' TO WRK-MES(1).
           MOVE 'FEV' TO WRK-MES(2).
           MOVE 'MAR' TO WRK-MES(3).
           MOVE 'ABR' TO WRK-MES(4).
           MOVE 'MAI' TO WRK-MES(5).
           MOVE 'JUN' TO WRK-MES(6).
           MOVE 'JUL' TO WRK-MES(7).
           MOVE 'AUG' TO WRK-MES(8).
           MOVE 'SEM' TO WRK-MES(9).
           MOVE 'OUT' TO WRK-MES(10).
           MOVE 'NOV' TO WRK-MES(11).
           MOVE 'DEZ' TO WRK-MES(12).
       
       0002-PRINTAR-MESES-RESPECTIVOS-VALORES.

           PERFORM VARYING WRK-CONT FROM 1 BY 1 UNTIL WRK-CONT > 12

               MOVE WRK-MES-VENDAS(WRK-CONT) TO WRK-MES-VENDAS-ED
               
               DISPLAY WRK-MES(WRK-CONT) ':' WRK-MES-VENDAS-ED

               END-PERFORM.

       0003-PERGUNTAR-MES-VENDAS-PRINTAR.

           DISPLAY 'DIGITE O MES'.
           ACCEPT MES-DIGITADO.
           
           IF MES-DIGITADO <= 12

               DISPLAY 'DIGITE O VALOR DA VENDA'
               ACCEPT WRK-VALOR-VENDA-DIGITADO
               COMPUTE WRK-MES-VENDAS(MES-DIGITADO) = 
               WRK-MES-VENDAS(MES-DIGITADO) + WRK-VALOR-VENDA-DIGITADO

               MOVE WRK-MES-VENDAS(MES-DIGITADO) TO WRK-MES-VENDAS-ED 

               PERFORM 0002-PRINTAR-MESES-RESPECTIVOS-VALORES
           
           ELSE IF MES-DIGITADO > 12 AND MES-DIGITADO NOT EQUAL TO 99
               DISPLAY 'MES INVALIDO, DIGITE NOVAMENTE'.

           

