       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.  
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WRK-DIAS-UTEIS.
           02 WRK-DIA-UTIL PIC X(7) OCCURS 5 TIMES.
       77  WRK-DIA-USUARIO PIC 9 VALUE ZERO.
       PROCEDURE DIVISION.
           
           DISPLAY 'DIGITE O NUMERO DO DIA DA SEMANA'.
           ACCEPT WRK-DIA-USUARIO.
           PERFORM 0001-MONTA-SEMANA-TRABALHO.
           
           DISPLAY 'HOJE E ' WRK-DIA-UTIL(WRK-DIA-USUARIO).

           STOP RUN. 

       0001-MONTA-SEMANA-TRABALHO.
           MOVE 'SEGUNDA' TO WRK-DIA-UTIL(1)
           MOVE 'TERÇA' TO WRK-DIA-UTIL(2)
           MOVE 'QUARTA' TO WRK-DIA-UTIL(3)
           MOVE 'QUINTA' TO WRK-DIA-UTIL(4)
           MOVE 'SEXTA' TO WRK-DIA-UTIL(5).