       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.  
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY 'BOOK.COB'.
       PROCEDURE DIVISION.
           DISPLAY WRK-VARIAVEL-AMPLAMENTE-USADA.
           STOP RUN.
 