       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.  
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77  WS-PRODUCT-01 PIC 9(6)V9999 VALUES ZERO.
       77  WS-PRODUCT-02 PIC 9(6)V9999 VALUES ZERO.
       77  WS-MEAN PIC 9(7)V9999 VALUES ZERO.
       77  WS-MEAN-ED PIC $zzz.zz9,9999 VALUES ZERO.
       PROCEDURE DIVISION.
           DISPLAY 'TYPE THE PRICE OF PRODUCT 01'.
           ACCEPT WS-PRODUCT-01 FROM CONSOLE.
           DISPLAY 'TYPE THE PRICE OF PRODUCT 02'.
           ACCEPT WS-PRODUCT-02 FROM CONSOLE.
           COMPUTE WS-MEAN = (WS-PRODUCT-01 + WS-PRODUCT-02) / 2.
           MOVE WS-MEAN TO WS-MEAN-ED.
           DISPLAY 'RESULT: ' WS-MEAN-ED.
           DISPLAY 'RESULT (SEM FORMAÇÃO): ' WS-MEAN.
           STOP RUN.
            