       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

      *AUTHOR: HERBERT HIPOLITO 
      *29/10/2023
      *RECEBER E IMPRIMIR A DATA DO SISTEMA

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       
       01  WRK-DATA.
           02 WRK-ANO PIC 9(04) VALUE ZERO.
           02 WRK-MES PIC 9(02) VALUE ZERO.
           02 WRK-DIA PIC 9(02) VALUE ZERO.

       PROCEDURE DIVISION.
           ACCEPT WRK-DATA FROM DATE YYYYMMDD.
           DISPLAY 'DATA: ' WRK-DIA '/' WRK-MES '/' WRK-ANO.
           STOP RUN.
