       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

      *AUTHOR: HERBERT HIPOLITO 
      *29/10/2023
      *SINAL POSITIVO E NEGATIVO

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
             DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  WRK-NUM1 PIC S9(3) VALUE ZEROS.
       77  WRK-NUM2 PIC S9(3) VALUE ZEROS.
       77  WRK-RESULT PIC S9(4) VALUE ZEROS.
       77  WRK-RESULT-ED PIC -ZZ9.

       PROCEDURE DIVISION.

           DISPLAY 'TYPE NUMBER 01'.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           DISPLAY 'TYPE NUMBER 02'.
           ACCEPT WRK-NUM2 FROM CONSOLE.

           ADD WRK-NUM1 WRK-NUM2 TO WRK-RESULT.
           MOVE WRK-RESULT TO WRK-RESULT-ED.
           
      *    SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESULT.
      *    DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESULT.
      *    DIVIDE WRK-NUM1 BY WRK-NUM2 REMINDER WRK-RESULT.
      *    COMPUTE WRK-RESULT = (WRK-NUM1 + WRK-NUM2) / 2.

           DISPLAY WRK-RESULT.
           DISPLAY WRK-RESULT-ED.

           STOP RUN.
