       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.  
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-CONTADOR PIC 9(2) VALUE ZERO.
       PROCEDURE DIVISION.

       0001-FIRST-PERFORM.
           PERFORM 3 TIMES
               DISPLAY 'FOR 1'
           END-PERFORM.
       0002-SECOND-PERFORM.
           PERFORM VARYING WRK-CONTADOR FROM 1 BY 1 UNTIL WRK-CONTADOR
           >3
               DISPLAY 'FOR 2 ' WRK-CONTADOR
           END-PERFORM.
       0003-THIRD-PERFORM.
           PERFORM 0004-TEST-PERFORM UNTIL WRK-CONTADOR = 7.
       0004-TEST-PERFORM.
           DISPLAY 'FOR 3 ' WRK-CONTADOR
           ADD 1 TO WRK-CONTADOR
           PERFORM 0003-THIRD-PERFORM.

           STOP RUN.
 