       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
      *AUTHOR: HERBERT HIPOLITO 
      *29/10/2023
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO BB'.
           STOP RUN.
