       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.

      *AUTHOR: HERBERT HIPOLITO 
      *29/10/2023
      *RECEBER CPF E IMPRIMIR FORMATADO.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WRK-CPF.
           02  WRK-CPF-FIRST-PART PIC X(03) VALUES SPACES.
           02  WRK-CPF-SECOND-PART PIC X(03) VALUES SPACES.
           02  WRK-CPF-THIRD-PART PIC X(03) VALUES SPACES.
           02  WRK-CPF-FOURTH-PART PIC X(02) VALUES SPACES.
      
       PROCEDURE DIVISION.

           DISPLAY 'TYPE YOUR CPF'.           
           ACCEPT WRK-CPF FROM CONSOLE.

           DISPLAY 'CPF: 'WRK-CPF-FIRST-PART'.' WRK-CPF-SECOND-PART '.' 
           WRK-CPF-THIRD-PART '-' WRK-CPF-FOURTH-PART.
           
           STOP RUN.
